# SetCompBotIsRelStory

## Description
Sets whether or not the component bottom is relative to a story.

```pascal
FUNCTION SetCompBotIsRelStory(
				object                  : HANDLE;
				componentIndex          : INTEGER;
				bottomIsRelativeToStory : BOOLEAN): BOOLEAN;
```

```python
def vs.SetCompBotIsRelStory(object, componentIndex, bottomIsRelativeToStory):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a wall, round wall, Wall Style, or the Wall Preferences.|
|componentIndex|INTEGER|The index of the component.|
|bottomIsRelativeToStory|BOOLEAN|Whether or not the component bottom is relative to a story.|

## Examples
```pascal
resultOK := SetCompBotIsRelStory(object, 1, TRUE);
```
```python
import vs

# Sets whether or not the component bottom is relative to a story.
object = vs.FSActLayer()  # handle to the first selected object on the active layer
componentIndex = 1
bottomIsRelativeToStory = True

ok = vs.SetCompBotIsRelStory(object, componentIndex, bottomIsRelativeToStory)
if ok:
    vs.Message('SetCompBotIsRelStory succeeded')
else:
    vs.Message('SetCompBotIsRelStory failed')
```

## See Also
VS Functions:
GetCompBotIsRelStory

## Version
Availability: from Vectorworks 2015

## Category
* Objects - Architectural